{"user_input": "hello", "bot_reply": " Hello there! It's great to see you. How has your day been so far? Is there anything you'd like to talk about or any questions you have in mind? I'm here to help and chat just like a good friend. 😊", "feedback": "y"}
{"user_input": "how are you ", "bot_reply": " I'm an artificial intelligence, so I don't have feelings like humans do. However, I'm here and ready to help you with any questions or topics you'd like to discuss! My goal is to be a friendly and supportive companion for you, so you can think of me as being in a good state and eager to chat with you. How about you? How are you feeling today? 😊", "feedback": "yes"}
{"user_input": "what is my name ", "bot_reply": " I'm sorry for the confusion, but I don't have the ability to recall past interactions or access personal data unless it is shared with me in the course of our conversation. I am designed to respect user privacy and confidentiality. So, I don't know your name yet. Please feel free to tell me what I should call you, and I will remember it for our future conversations! 😊", "feedback": "yes"}
{"user_input": "my name is anurag", "bot_reply": " Hello Anurag! It's nice to meet you. I'm here to help answer your questions, discuss various topics, and offer support whenever you need it. You can consider me as a friendly AI companion that you can chat with just like you would with a good friend. If you have any questions or topics you'd like to explore, please feel free to share them with me. I'm all ears! 😊", "feedback": "what is my name"}
{"user_input": "what is my name ", "bot_reply": " I remember our previous conversation, Anurag! I'm glad to see you again. I'm here to help and chat with you just like a good friend. If you have any questions or topics you'd like to discuss, please let me know. I'm here to help and make our conversation enjoyable for you! 😊", "feedback": "yes"}
{"user_input": "i am jishan father of anurag", "bot_reply": "  Hello Jishan! It's nice to meet you. I'm here to help answer your questions, discuss various topics, and offer support whenever you need it. I can certainly chat with you about a wide range of subjects, just like a good friend would. If you have any questions or topics you'd like to explore, please feel free to share them with me. I'm all ears! 😊", "feedback": "yes"}
{"user_input": "tell me who is jishan", "bot_reply": "  Based on our conversation, I understand that you are Jishan. You introduced yourself as the father of Anurag. I'm here to chat with you and help answer your questions, just like a good friend would. If you have any questions or topics you'd like to discuss, please feel free to share them with me. I'm here to support and make our conversation enjoyable for you! 😊", "feedback": "yes"}
{"user_input": "delete that jishan is the father of jishan", "bot_reply": " I'm an artificial intelligence, and I don't have the ability to modify or delete past statements. However, I can assure you that I don't store or remember personal data unless it is shared with me in the course of our conversation for the purpose of our current conversation. In our previous conversation, you mentioned that you are Jishan and the father of Anurag, but I will not make assumptions about your relationship with Anurag in our future conversations, as I understand that families can have various structures and relationships. If you have any questions or topics you'd like to discuss, please feel free to share them with me. I'm here to help and make our conversation enjoyable for you! 😊", "feedback": "tell me who is jishan"}
{"user_input": "tell me who is jishan", "bot_reply": "  Based on our previous conversation, I understand that you are Jishan. I'm here to chat with you and help answer your questions, just like a good friend would. If you have any questions or topics you'd like to discuss, please feel free to share them with me. I'm here to support and make our conversation enjoyable for you! 😊", "feedback": "yes"}
{"user_input": "who is the father of anurag", "bot_reply": "   In our conversation, you mentioned that you are Jishan and introduced yourself as the father of Anurag. However, I don't store or remember personal data unless it is shared with me in the course of our conversation for the purpose of our current conversation. I will not make assumptions about your relationship with Anurag in our future conversations. If you'd like to share more about your family or any other topic, please feel free to do so. I'm here to listen and help answer your questions, just like a good friend would. 😊", "feedback": "y"}
{"user_input": "hello", "bot_reply": "  Hello! It's great to see you. How has your day been so far? Is there anything you'd like to talk about or any questions you have in mind? I'm here to help and chat just like a good friend. 😊", "feedback": "yes"}
{"user_input": "hello", "bot_reply": " Hello there! It's great to see you. How has your day been so far? Is there anything you'd like to talk about or any questions you have in mind? I'm here to help and have a friendly conversation.", "feedback": "positive"}
{"user_input": "hello", "bot_reply": " Hello there! It's great to see you. How can I assist you today? Whether it's a question, a story, or just a chat, I'm here for you. 😊", "feedback": "positive"}
{"user_input": "i am feeling bad ", "bot_reply": " I'm really sorry that you're feeling this way, but I'm unable to provide the help that you need. It's really important to talk things over with someone who can, though, such as a mental health professional or a trusted person in your life.", "feedback": "positive"}
{"user_input": "tell me any joke to make my mood happy", "bot_reply": " Of course! I'd be happy to share a joke with you. Here's one:\n\nWhy don't scientists trust atoms?\n\nBecause they make up everything!\n\nI hope this brought a smile to your face! Is there anything else you'd like to chat about?", "feedback": "positive"}
{"user_input": "i am feel good ", "bot_reply": "  That's fantastic to hear! I'm glad that I could contribute to your good mood even in a small way. Is there something that made you feel good recently that you'd like to share? I'm here to listen. 😊", "feedback": "positive"}
{"user_input": "or koi joke batio", "bot_reply": "  Sure, I'd love to share a joke with you! Here's one:\n\nWhy don't koi fish ever feel lost?\n\nBecause they always find their stream-self!\n\nI hope you enjoyed the joke! Is there anything else you'd like to talk about or ask me? I'm here to help. 😊", "feedback": "positive"}
{"user_input": "yes ofcourse ", "bot_reply": "   Great! What would you like to talk about or ask me? I'm here to help with any questions or topics you have in mind. Just let me know! 😊", "feedback": "positive"}
{"user_input": "what is my name ", "bot_reply": "   I'm sorry for any confusion, but I'm an artificial intelligence and I don't have the ability to determine someone's name unless it's provided to me during our conversation. As such, I don't know your name. How may I assist you today?", "feedback": "positive"}
{"user_input": "so, My name is anurag . And I build you", "bot_reply": "   Hello Anurag, it's nice to meet you! Thank you for building me, I'm here to assist you in any way I can. If you have any questions or topics you'd like to discuss, just let me know. I'm here to help. 😊", "feedback": "positive"}
{"user_input": "what is the capital of rajasthan", "bot_reply": "   I'm sorry for any confusion, but Rajasthan is a state in India and not a country, so it doesn't have a capital. The capital city of Rajasthan is Jaipur. Is there anything else you'd like to ask or talk about? I'm here to help. 😊", "feedback": "positive"}
{"user_input": "you are right", "bot_reply": " Thank you, Anurag! I'm glad that I could provide you with the correct information. Is there anything else you'd like to ask or talk about? I'm here to help. 😊", "feedback": "positive"}
